import React from 'react';

const Process = () => {
  return (
    <section id="процесс" className="process landing-wrapper">
      <div className="decor-fill"></div>

      <h1 className="manrope">
        КАК МЫ
        <br />
        РАБОТАЕМ?
      </h1>

      <div className="process-wrap">
        <p>
          Мы преображаем ваши идеи в успешные стартапы, предлагая интегральный подход к вашему
          бизнесу. Начнем с глубокого анализа вашего проекта, выявим его сильные и слабые стороны и
          определим потребности в развитии. Затем, разработав индивидуальную стратегию, мы
          адаптируем наши решения под ваши цели и ресурсы, обеспечивая наилучшие результаты.
        </p>
        <p>
          Мы предоставим доступ к экспертам и менторам с богатым опытом, которые помогут вам
          развивать навыки и знания, необходимые для успешного участия в бизнес акселераторе или
          инкубаторе. Наконец, мы найдем оптимальные варианты финансирования, которые подходят
          именно вашему проекту, предлагая наиболее подходящие форматы инвестиций и финансирования,
          чтобы обеспечить успешное развитие вашего бизнеса.
        </p>
      </div>

      <div className="main-btn">Подать заявку</div>
    </section>
  );
};

export default Process;
